# Questions to ask before the project

# 1 - Кому нужны результаты? Уточните, кто конечный «заказчик» результата.

# 2 - Что мы будем делать с полученным результатом?

# 3 - Уточните все параметры, которые хочет знать заказчик задачи.
# Нет ли подводных камней? Где можно проверить первый прототип модели?
# Какие ресурсные ограничения на разработку модели есть?

# 4 - Проговорите и зафиксируйте образ идеального конечного результата.
# Где фиксировать: в тикете, в почте, в таск-менеджере — зависит
# от компании. Даже если заказчик утверждает, что устной
# договорённости достаточно, мы рекомендуем записать вводные параметры,
# чтобы было с чем сверяться.

# 5 - Набросайте прототип решения — и сверьтесь с заказчиком, подойдёт ли оно?
# Возможны несколько циклов «прототип —> обратная связь —> исправления», пока вы не согласуете удобную форму.

# 6 - Предоставьте заказчику конечный результат.
# Если была письменная коммуникация, завершите её — закройте тикеты
# или задачу в таск-менеджере.